Revit 2027 API
ParameterTypeId.EnergyAnalysisMasszoneUseenergydatasettings Property
 "Use Energy Data"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisMasszoneUseenergydatasettings { get; }
Public Shared ReadOnly Property EnergyAnalysisMasszoneUseenergydatasettings As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisMasszoneUseenergydatasettings {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisMasszoneUseenergydatasettings : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace